; domain
(define (domain sobokosnake)
(:requirements :typing :negative-preconditions)
(:types location direction - object)
(:predicates
    ;up down left right of a field
    (MOVE-DIR ?x ?y - location ?dir - direction)
    ;snake that has not eaten anything yet
    (thinsnake ?x - location)
    ;the last field of the snake
    (tailsnake ?x - location)
    ;the first field of the snake
    (headsnake ?x - location)
    ;pieces of the snake that are connected. from front to back
    (nextsnake ?x ?y - location)
    ;a field that is occupied by the snake or by a hole
    (blocked ?x - location)
    ;a field that has a point that can be collected by the snake
    (ispoint ?x - location)
    ;a field that is occupied by an obstacle
    (isbox ?x - location)
    ;a field that has a hole on it
    (ishole ?x - location)
)

(:action move-thin-snake
    ;move thin snake
    :parameters (?oldposition ?newposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?oldposition)
        (MOVE-DIR ?oldposition ?newposition ?dir)
        (not (blocked ?newposition))
        (not (ispoint ?newposition))
        (not (isbox ?newposition))
    )
    :effect
    (and
        (thinsnake ?newposition)
        (blocked ?newposition)
        (not (thinsnake ?oldposition))
        (not (blocked ?oldposition))
    )
)
(:action move-thin-snake-and-box
    ;move thin snake and push box
    :parameters (?oldposition ?newposition ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?oldposition)
        (MOVE-DIR ?oldposition ?newposition ?dir)
        (MOVE-DIR ?newposition ?newboxposition ?dir)
        (not (blocked ?newboxposition))
        (not (ispoint ?newposition))
        (isbox ?newposition)
        (not (isbox ?newboxposition))
        
    )
    :effect
    (and
        (thinsnake ?newposition)
        (blocked ?newposition)
        (not (thinsnake ?oldposition))
        (not (blocked ?oldposition))
        (not (isbox ?newposition))
        (isbox ?newboxposition)
    )
)
(:action move-thin-snake-and-box-to-hole
    ;move thin snake and push box to a hole
    :parameters (?oldposition ?newposition ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?oldposition)
        (MOVE-DIR ?oldposition ?newposition ?dir)
        (MOVE-DIR ?newposition ?newboxposition ?dir)
        (not (ispoint ?newposition))
        (isbox ?newposition)
        (ishole ?newboxposition)
        
    )
    :effect
    (and
        (thinsnake ?newposition)
        (blocked ?newposition)
        (not (thinsnake ?oldposition))
        (not (blocked ?oldposition))
        (not (isbox ?newposition))
        (not (ishole ?newboxposition))
        (not (blocked ?newboxposition))
    )
)



(:action move-thin-snake-and-first-eat
    ;move thin snake and eat
    :parameters (?position ?newhead - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?position)
        (MOVE-DIR ?position ?newhead ?dir)
        (not (blocked ?newhead))
        (ispoint ?newhead)
        (not (isbox ?newhead))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (tailsnake ?position)
        (nextsnake ?newhead ?position)
        (not (ispoint ?newhead))
        (not (thinsnake ?position))
    )
)
(:action move-box-and-first-eat
    ;move thin snake, push box and eat
    :parameters (?position ?newhead ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?position)
        (MOVE-DIR ?position ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (not (blocked ?newboxposition))
        (ispoint ?newhead)
        (isbox ?newhead)
        (not (isbox ?newboxposition))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (tailsnake ?position)
        (nextsnake ?newhead ?position)
        (not (ispoint ?newhead))
        (not (thinsnake ?position))
        (not (isbox ?newhead))
        (isbox ?newboxposition)
    )
)
(:action move-box-to-hole-and-first-eat
    ;move thin snake, push box to a hole and eat
    :parameters (?position ?newhead ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?position)
        (MOVE-DIR ?position ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (ispoint ?newhead)
        (isbox ?newhead)
        (ishole ?newboxposition)
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (tailsnake ?position)
        (nextsnake ?newhead ?position)
        (not (ispoint ?newhead))
        (not (thinsnake ?position))
        (not (isbox ?newhead))
        (not (ishole ?newboxposition))
        (not (blocked ?newboxposition))
    )
)
(:action move-fat-snake
    ;move snake
    :parameters (?head ?newhead ?tail ?newtail - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (tailsnake ?tail)
        (nextsnake ?newtail ?tail)
        (not (blocked ?newhead))
        (not (ispoint ?newhead))
        (not (isbox ?newhead))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (blocked ?tail))
        (not (tailsnake ?tail))
        (not (nextsnake ?newtail ?tail))
        (tailsnake ?newtail)
    )
)
(:action move-fat-snake-and-box
    ;move snake and push box
    :parameters (?head ?newhead ?tail ?newtail ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (tailsnake ?tail)
        (nextsnake ?newtail ?tail)
        (not (blocked ?newboxposition))
        (not (ispoint ?newhead))
        (isbox ?newhead)
        (not (isbox ?newboxposition))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (blocked ?tail))
        (not (tailsnake ?tail))
        (not (nextsnake ?newtail ?tail))
        (tailsnake ?newtail)
        (not (isbox ?newhead))
        (isbox ?newboxposition)
    )
)
(:action move-fat-snake-and-box-to-hole
    ;move snake and push box to a hole
    :parameters (?head ?newhead ?tail ?newtail ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (tailsnake ?tail)
        (nextsnake ?newtail ?tail)
        (not (ispoint ?newhead))
        (isbox ?newhead)
        (ishole ?newboxposition)
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (blocked ?tail))
        (not (tailsnake ?tail))
        (not (nextsnake ?newtail ?tail))
        (tailsnake ?newtail)
        (not (isbox ?newhead))
        (not (ishole ?newboxposition))
        (not (blocked ?newboxposition))
    )
)
(:action move-and-eat
    ;move snake and eat
    :parameters (?head ?newhead - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (not (blocked ?newhead))
        (ispoint ?newhead)
        (not (isbox ?newhead))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
    )
)
(:action move-box-and-eat
    ;move snake, push box and eat
    :parameters (?head ?newhead ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (not (blocked ?newboxposition))
        (ispoint ?newhead)
        (isbox ?newhead)
        (not (isbox ?newboxposition))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
        (not (isbox ?newhead))
        (isbox ?newboxposition)
    )
)
(:action move-box-to-hole-and-eat
    ;move snake, push box to a hole and eat
    :parameters (?head ?newhead ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (ispoint ?newhead)
        (isbox ?newhead)
        (ishole ?newboxposition)
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
        (not (isbox ?newhead))
        (not (ishole ?newboxposition))
        (not (blocked ?newboxposition))
    )
)
)

; problem
(define (problem sobokosnake-6-3)
(:domain sobokosnake)
(:objects
    pos0-5 - location
    pos0-6 - location
    pos0-7 - location
    pos1-4 - location
    pos1-5 - location
    pos1-6 - location
    pos1-7 - location
    pos2-3 - location
    pos2-4 - location
    pos2-5 - location
    pos2-7 - location
    pos3-3 - location
    pos3-4 - location
    pos3-5 - location
    pos3-6 - location
    pos3-7 - location
    pos4-6 - location
    pos5-0 - location
    pos5-1 - location
    pos5-2 - location
    pos5-3 - location
    pos5-5 - location
    pos5-6 - location
    pos5-7 - location
    pos6-0 - location
    pos6-1 - location
    pos6-3 - location
    pos6-4 - location
    pos6-5 - location
    pos6-7 - location
    pos7-3 - location
    pos7-5 - location
    pos7-6 - location
    pos7-7 - location
    pos8-1 - location
    pos8-2 - location
    pos8-3 - location
    pos9-1 - location
    pos9-2 - location
    pos9-3 - location
    dir-right - direction
    dir-left - direction
    dir-up - direction
    dir-down - direction
)
(:init
    (MOVE-DIR pos0-5 pos0-6 dir-right)
    (MOVE-DIR pos0-5 pos1-5 dir-down)
    (MOVE-DIR pos0-6 pos0-5 dir-left)
    (MOVE-DIR pos0-6 pos0-7 dir-right)
    (MOVE-DIR pos0-6 pos1-6 dir-down)
    (MOVE-DIR pos0-7 pos0-6 dir-left)
    (MOVE-DIR pos0-7 pos1-7 dir-down)
    (MOVE-DIR pos1-4 pos1-5 dir-right)
    (MOVE-DIR pos1-4 pos2-4 dir-down)
    (MOVE-DIR pos1-5 pos1-4 dir-left)
    (MOVE-DIR pos1-5 pos1-6 dir-right)
    (MOVE-DIR pos1-5 pos2-5 dir-down)
    (MOVE-DIR pos1-5 pos0-5 dir-up)
    (MOVE-DIR pos1-6 pos1-5 dir-left)
    (MOVE-DIR pos1-6 pos1-7 dir-right)
    (MOVE-DIR pos1-6 pos0-6 dir-up)
    (MOVE-DIR pos1-7 pos1-6 dir-left)
    (MOVE-DIR pos1-7 pos2-7 dir-down)
    (MOVE-DIR pos1-7 pos0-7 dir-up)
    (MOVE-DIR pos2-3 pos2-4 dir-right)
    (MOVE-DIR pos2-3 pos3-3 dir-down)
    (MOVE-DIR pos2-4 pos2-3 dir-left)
    (MOVE-DIR pos2-4 pos2-5 dir-right)
    (MOVE-DIR pos2-4 pos3-4 dir-down)
    (MOVE-DIR pos2-4 pos1-4 dir-up)
    (MOVE-DIR pos2-5 pos2-4 dir-left)
    (MOVE-DIR pos2-5 pos3-5 dir-down)
    (MOVE-DIR pos2-5 pos1-5 dir-up)
    (MOVE-DIR pos2-7 pos3-7 dir-down)
    (MOVE-DIR pos2-7 pos1-7 dir-up)
    (MOVE-DIR pos3-3 pos3-4 dir-right)
    (MOVE-DIR pos3-3 pos2-3 dir-up)
    (MOVE-DIR pos3-4 pos3-3 dir-left)
    (MOVE-DIR pos3-4 pos3-5 dir-right)
    (MOVE-DIR pos3-4 pos2-4 dir-up)
    (MOVE-DIR pos3-5 pos3-4 dir-left)
    (MOVE-DIR pos3-5 pos3-6 dir-right)
    (MOVE-DIR pos3-5 pos2-5 dir-up)
    (MOVE-DIR pos3-6 pos3-5 dir-left)
    (MOVE-DIR pos3-6 pos3-7 dir-right)
    (MOVE-DIR pos3-6 pos4-6 dir-down)
    (MOVE-DIR pos3-7 pos3-6 dir-left)
    (MOVE-DIR pos3-7 pos2-7 dir-up)
    (MOVE-DIR pos4-6 pos5-6 dir-down)
    (MOVE-DIR pos4-6 pos3-6 dir-up)
    (MOVE-DIR pos5-0 pos5-1 dir-right)
    (MOVE-DIR pos5-0 pos6-0 dir-down)
    (MOVE-DIR pos5-1 pos5-0 dir-left)
    (MOVE-DIR pos5-1 pos5-2 dir-right)
    (MOVE-DIR pos5-1 pos6-1 dir-down)
    (MOVE-DIR pos5-2 pos5-1 dir-left)
    (MOVE-DIR pos5-2 pos5-3 dir-right)
    (MOVE-DIR pos5-3 pos5-2 dir-left)
    (MOVE-DIR pos5-3 pos6-3 dir-down)
    (MOVE-DIR pos5-5 pos5-6 dir-right)
    (MOVE-DIR pos5-5 pos6-5 dir-down)
    (MOVE-DIR pos5-6 pos5-5 dir-left)
    (MOVE-DIR pos5-6 pos5-7 dir-right)
    (MOVE-DIR pos5-6 pos4-6 dir-up)
    (MOVE-DIR pos5-7 pos5-6 dir-left)
    (MOVE-DIR pos5-7 pos6-7 dir-down)
    (MOVE-DIR pos6-0 pos5-0 dir-up)
    (MOVE-DIR pos6-0 pos6-1 dir-right)
    (MOVE-DIR pos6-1 pos6-0 dir-left)
    (MOVE-DIR pos6-1 pos5-1 dir-up)
    (MOVE-DIR pos6-3 pos6-4 dir-right)
    (MOVE-DIR pos6-3 pos7-3 dir-down)
    (MOVE-DIR pos6-3 pos5-3 dir-up)
    (MOVE-DIR pos6-4 pos6-3 dir-left)
    (MOVE-DIR pos6-4 pos6-5 dir-right)
    (MOVE-DIR pos6-5 pos6-4 dir-left)
    (MOVE-DIR pos6-5 pos7-5 dir-down)
    (MOVE-DIR pos6-5 pos5-5 dir-up)
    (MOVE-DIR pos6-7 pos5-7 dir-up)
    (MOVE-DIR pos6-7 pos7-7 dir-down)
    (MOVE-DIR pos7-3 pos8-3 dir-down)
    (MOVE-DIR pos7-3 pos6-3 dir-up)
    (MOVE-DIR pos7-5 pos7-6 dir-right)
    (MOVE-DIR pos7-5 pos6-5 dir-up)
    (MOVE-DIR pos7-6 pos7-5 dir-left)
    (MOVE-DIR pos7-6 pos7-7 dir-right)
    (MOVE-DIR pos7-7 pos6-7 dir-up)
    (MOVE-DIR pos7-7 pos7-6 dir-left)
    (MOVE-DIR pos8-1 pos8-2 dir-right)
    (MOVE-DIR pos8-1 pos9-1 dir-down)
    (MOVE-DIR pos8-2 pos8-1 dir-left)
    (MOVE-DIR pos8-2 pos8-3 dir-right)
    (MOVE-DIR pos8-2 pos9-2 dir-down)
    (MOVE-DIR pos8-3 pos8-2 dir-left)
    (MOVE-DIR pos8-3 pos9-3 dir-down)
    (MOVE-DIR pos8-3 pos7-3 dir-up)
    (MOVE-DIR pos9-1 pos9-2 dir-right)
    (MOVE-DIR pos9-1 pos8-1 dir-up)
    (MOVE-DIR pos9-2 pos9-1 dir-left)
    (MOVE-DIR pos9-2 pos9-3 dir-right)
    (MOVE-DIR pos9-2 pos8-2 dir-up)
    (MOVE-DIR pos9-3 pos9-2 dir-left)
    (MOVE-DIR pos9-3 pos8-3 dir-up)
    (thinsnake pos6-3)
    (blocked pos6-3)
    (ispoint pos0-5)
    (ispoint pos0-6)
    (ispoint pos0-7)
    (ispoint pos1-4)
    (ispoint pos2-3)
    (ispoint pos2-5)
    (ispoint pos2-7)
    (ispoint pos3-3)
    (ispoint pos5-1)
    (ispoint pos5-5)
    (ispoint pos5-6)
    (ispoint pos5-7)
    (ispoint pos6-0)
    (ispoint pos6-5)
    (ispoint pos6-7)
    (ispoint pos7-5)
    (ispoint pos7-6)
    (ispoint pos7-7)
    (ispoint pos8-2)
)
(:goal
(and
    (not (ispoint pos0-5))
    (not (ispoint pos0-6))
    (not (ispoint pos0-7))
    (not (ispoint pos1-4))
    (not (ispoint pos2-3))
    (not (ispoint pos2-5))
    (not (ispoint pos2-7))
    (not (ispoint pos3-3))
    (not (ispoint pos5-1))
    (not (ispoint pos5-5))
    (not (ispoint pos5-6))
    (not (ispoint pos5-7))
    (not (ispoint pos6-0))
    (not (ispoint pos6-5))
    (not (ispoint pos6-7))
    (not (ispoint pos7-5))
    (not (ispoint pos7-6))
    (not (ispoint pos7-7))
    (not (ispoint pos8-2))
)
)
)

; plan
1. (move-thin-snake pos6-3 pos7-3 dir-down)
   deleted: (thinsnake pos6-3) (blocked pos6-3)
   added: (thinsnake pos7-3) (blocked pos7-3)
   goals met: 0 of 19
2. (move-thin-snake pos7-3 pos8-3 dir-down)
   deleted: (thinsnake pos7-3) (blocked pos7-3)
   added: (thinsnake pos8-3) (blocked pos8-3)
   goals met: 0 of 19
3. (move-thin-snake pos8-3 pos9-3 dir-down)
   deleted: (thinsnake pos8-3) (blocked pos8-3)
   added: (thinsnake pos9-3) (blocked pos9-3)
   goals met: 0 of 19
4. (move-thin-snake pos9-3 pos9-2 dir-left)
   deleted: (thinsnake pos9-3) (blocked pos9-3)
   added: (thinsnake pos9-2) (blocked pos9-2)
   goals met: 0 of 19
5. (move-thin-snake-and-first-eat pos9-2 pos8-2 dir-up)
   deleted: (ispoint pos8-2) (thinsnake pos9-2)
   added: (blocked pos8-2) (headsnake pos8-2) (tailsnake pos9-2) (nextsnake pos8-2 pos9-2)
   goals met: 1 of 19
6. (move-fat-snake pos8-2 pos8-3 pos9-2 pos8-2 dir-right)
   deleted: (headsnake pos8-2) (blocked pos9-2) (tailsnake pos9-2) (nextsnake pos8-2 pos9-2)
   added: (blocked pos8-3) (headsnake pos8-3) (nextsnake pos8-3 pos8-2) (tailsnake pos8-2)
   goals met: 1 of 19
7. (move-fat-snake pos8-3 pos7-3 pos8-2 pos8-3 dir-up)
   deleted: (headsnake pos8-3) (blocked pos8-2) (tailsnake pos8-2) (nextsnake pos8-3 pos8-2)
   added: (blocked pos7-3) (headsnake pos7-3) (nextsnake pos7-3 pos8-3) (tailsnake pos8-3)
   goals met: 1 of 19
8. (move-fat-snake pos7-3 pos6-3 pos8-3 pos7-3 dir-up)
   deleted: (headsnake pos7-3) (blocked pos8-3) (tailsnake pos8-3) (nextsnake pos7-3 pos8-3)
   added: (blocked pos6-3) (headsnake pos6-3) (nextsnake pos6-3 pos7-3) (tailsnake pos7-3)
   goals met: 1 of 19
9. (move-fat-snake pos6-3 pos6-4 pos7-3 pos6-3 dir-right)
   deleted: (headsnake pos6-3) (blocked pos7-3) (tailsnake pos7-3) (nextsnake pos6-3 pos7-3)
   added: (blocked pos6-4) (headsnake pos6-4) (nextsnake pos6-4 pos6-3) (tailsnake pos6-3)
   goals met: 1 of 19
10. (move-and-eat pos6-4 pos6-5 dir-right)
   deleted: (headsnake pos6-4) (ispoint pos6-5)
   added: (blocked pos6-5) (headsnake pos6-5) (nextsnake pos6-5 pos6-4)
   goals met: 2 of 19
11. (move-and-eat pos6-5 pos5-5 dir-up)
   deleted: (headsnake pos6-5) (ispoint pos5-5)
   added: (blocked pos5-5) (headsnake pos5-5) (nextsnake pos5-5 pos6-5)
   goals met: 3 of 19
12. (move-and-eat pos5-5 pos5-6 dir-right)
   deleted: (headsnake pos5-5) (ispoint pos5-6)
   added: (blocked pos5-6) (headsnake pos5-6) (nextsnake pos5-6 pos5-5)
   goals met: 4 of 19
13. (move-fat-snake pos5-6 pos4-6 pos6-3 pos6-4 dir-up)
   deleted: (headsnake pos5-6) (blocked pos6-3) (tailsnake pos6-3) (nextsnake pos6-4 pos6-3)
   added: (blocked pos4-6) (headsnake pos4-6) (nextsnake pos4-6 pos5-6) (tailsnake pos6-4)
   goals met: 4 of 19
14. (move-fat-snake pos4-6 pos3-6 pos6-4 pos6-5 dir-up)
   deleted: (headsnake pos4-6) (blocked pos6-4) (tailsnake pos6-4) (nextsnake pos6-5 pos6-4)
   added: (blocked pos3-6) (headsnake pos3-6) (nextsnake pos3-6 pos4-6) (tailsnake pos6-5)
   goals met: 4 of 19
15. (move-fat-snake pos3-6 pos3-5 pos6-5 pos5-5 dir-left)
   deleted: (headsnake pos3-6) (blocked pos6-5) (tailsnake pos6-5) (nextsnake pos5-5 pos6-5)
   added: (blocked pos3-5) (headsnake pos3-5) (nextsnake pos3-5 pos3-6) (tailsnake pos5-5)
   goals met: 4 of 19
16. (move-and-eat pos3-5 pos2-5 dir-up)
   deleted: (headsnake pos3-5) (ispoint pos2-5)
   added: (blocked pos2-5) (headsnake pos2-5) (nextsnake pos2-5 pos3-5)
   goals met: 5 of 19
17. (move-fat-snake pos2-5 pos1-5 pos5-5 pos5-6 dir-up)
   deleted: (headsnake pos2-5) (blocked pos5-5) (tailsnake pos5-5) (nextsnake pos5-6 pos5-5)
   added: (blocked pos1-5) (headsnake pos1-5) (nextsnake pos1-5 pos2-5) (tailsnake pos5-6)
   goals met: 5 of 19
18. (move-fat-snake pos1-5 pos1-6 pos5-6 pos4-6 dir-right)
   deleted: (headsnake pos1-5) (blocked pos5-6) (tailsnake pos5-6) (nextsnake pos4-6 pos5-6)
   added: (blocked pos1-6) (headsnake pos1-6) (nextsnake pos1-6 pos1-5) (tailsnake pos4-6)
   goals met: 5 of 19
19. (move-fat-snake pos1-6 pos1-7 pos4-6 pos3-6 dir-right)
   deleted: (headsnake pos1-6) (blocked pos4-6) (tailsnake pos4-6) (nextsnake pos3-6 pos4-6)
   added: (blocked pos1-7) (headsnake pos1-7) (nextsnake pos1-7 pos1-6) (tailsnake pos3-6)
   goals met: 5 of 19
20. (move-and-eat pos1-7 pos2-7 dir-down)
   deleted: (headsnake pos1-7) (ispoint pos2-7)
   added: (blocked pos2-7) (headsnake pos2-7) (nextsnake pos2-7 pos1-7)
   goals met: 6 of 19
21. (move-fat-snake pos2-7 pos3-7 pos3-6 pos3-5 dir-down)
   deleted: (headsnake pos2-7) (blocked pos3-6) (tailsnake pos3-6) (nextsnake pos3-5 pos3-6)
   added: (blocked pos3-7) (headsnake pos3-7) (nextsnake pos3-7 pos2-7) (tailsnake pos3-5)
   goals met: 6 of 19
22. (move-fat-snake pos3-7 pos3-6 pos3-5 pos2-5 dir-left)
   deleted: (headsnake pos3-7) (blocked pos3-5) (tailsnake pos3-5) (nextsnake pos2-5 pos3-5)
   added: (blocked pos3-6) (headsnake pos3-6) (nextsnake pos3-6 pos3-7) (tailsnake pos2-5)
   goals met: 6 of 19
23. (move-fat-snake pos3-6 pos3-5 pos2-5 pos1-5 dir-left)
   deleted: (headsnake pos3-6) (blocked pos2-5) (tailsnake pos2-5) (nextsnake pos1-5 pos2-5)
   added: (blocked pos3-5) (headsnake pos3-5) (nextsnake pos3-5 pos3-6) (tailsnake pos1-5)
   goals met: 6 of 19
24. (move-fat-snake pos3-5 pos3-4 pos1-5 pos1-6 dir-left)
   deleted: (headsnake pos3-5) (blocked pos1-5) (tailsnake pos1-5) (nextsnake pos1-6 pos1-5)
   added: (blocked pos3-4) (headsnake pos3-4) (nextsnake pos3-4 pos3-5) (tailsnake pos1-6)
   goals met: 6 of 19
25. (move-and-eat pos3-4 pos3-3 dir-left)
   deleted: (headsnake pos3-4) (ispoint pos3-3)
   added: (blocked pos3-3) (headsnake pos3-3) (nextsnake pos3-3 pos3-4)
   goals met: 7 of 19
26. (move-and-eat pos3-3 pos2-3 dir-up)
   deleted: (headsnake pos3-3) (ispoint pos2-3)
   added: (blocked pos2-3) (headsnake pos2-3) (nextsnake pos2-3 pos3-3)
   goals met: 8 of 19
27. (move-fat-snake pos2-3 pos2-4 pos1-6 pos1-7 dir-right)
   deleted: (headsnake pos2-3) (blocked pos1-6) (tailsnake pos1-6) (nextsnake pos1-7 pos1-6)
   added: (blocked pos2-4) (headsnake pos2-4) (nextsnake pos2-4 pos2-3) (tailsnake pos1-7)
   goals met: 8 of 19
28. (move-and-eat pos2-4 pos1-4 dir-up)
   deleted: (headsnake pos2-4) (ispoint pos1-4)
   added: (blocked pos1-4) (headsnake pos1-4) (nextsnake pos1-4 pos2-4)
   goals met: 9 of 19
29. (move-fat-snake pos1-4 pos1-5 pos1-7 pos2-7 dir-right)
   deleted: (headsnake pos1-4) (blocked pos1-7) (tailsnake pos1-7) (nextsnake pos2-7 pos1-7)
   added: (blocked pos1-5) (headsnake pos1-5) (nextsnake pos1-5 pos1-4) (tailsnake pos2-7)
   goals met: 9 of 19
30. (move-and-eat pos1-5 pos0-5 dir-up)
   deleted: (headsnake pos1-5) (ispoint pos0-5)
   added: (blocked pos0-5) (headsnake pos0-5) (nextsnake pos0-5 pos1-5)
   goals met: 10 of 19
31. (move-and-eat pos0-5 pos0-6 dir-right)
   deleted: (headsnake pos0-5) (ispoint pos0-6)
   added: (blocked pos0-6) (headsnake pos0-6) (nextsnake pos0-6 pos0-5)
   goals met: 11 of 19
32. (move-and-eat pos0-6 pos0-7 dir-right)
   deleted: (headsnake pos0-6) (ispoint pos0-7)
   added: (blocked pos0-7) (headsnake pos0-7) (nextsnake pos0-7 pos0-6)
   goals met: 12 of 19
33. (move-fat-snake pos0-7 pos1-7 pos2-7 pos3-7 dir-down)
   deleted: (headsnake pos0-7) (blocked pos2-7) (tailsnake pos2-7) (nextsnake pos3-7 pos2-7)
   added: (blocked pos1-7) (headsnake pos1-7) (nextsnake pos1-7 pos0-7) (tailsnake pos3-7)
   goals met: 12 of 19
34. (move-fat-snake pos1-7 pos2-7 pos3-7 pos3-6 dir-down)
   deleted: (headsnake pos1-7) (blocked pos3-7) (tailsnake pos3-7) (nextsnake pos3-6 pos3-7)
   added: (blocked pos2-7) (headsnake pos2-7) (nextsnake pos2-7 pos1-7) (tailsnake pos3-6)
   goals met: 12 of 19
35. (move-fat-snake pos2-7 pos3-7 pos3-6 pos3-5 dir-down)
   deleted: (headsnake pos2-7) (blocked pos3-6) (tailsnake pos3-6) (nextsnake pos3-5 pos3-6)
   added: (blocked pos3-7) (headsnake pos3-7) (nextsnake pos3-7 pos2-7) (tailsnake pos3-5)
   goals met: 12 of 19
36. (move-fat-snake pos3-7 pos3-6 pos3-5 pos3-4 dir-left)
   deleted: (headsnake pos3-7) (blocked pos3-5) (tailsnake pos3-5) (nextsnake pos3-4 pos3-5)
   added: (blocked pos3-6) (headsnake pos3-6) (nextsnake pos3-6 pos3-7) (tailsnake pos3-4)
   goals met: 12 of 19
37. (move-fat-snake pos3-6 pos4-6 pos3-4 pos3-3 dir-down)
   deleted: (headsnake pos3-6) (blocked pos3-4) (tailsnake pos3-4) (nextsnake pos3-3 pos3-4)
   added: (blocked pos4-6) (headsnake pos4-6) (nextsnake pos4-6 pos3-6) (tailsnake pos3-3)
   goals met: 12 of 19
38. (move-fat-snake pos4-6 pos5-6 pos3-3 pos2-3 dir-down)
   deleted: (headsnake pos4-6) (blocked pos3-3) (tailsnake pos3-3) (nextsnake pos2-3 pos3-3)
   added: (blocked pos5-6) (headsnake pos5-6) (nextsnake pos5-6 pos4-6) (tailsnake pos2-3)
   goals met: 12 of 19
39. (move-and-eat pos5-6 pos5-7 dir-right)
   deleted: (headsnake pos5-6) (ispoint pos5-7)
   added: (blocked pos5-7) (headsnake pos5-7) (nextsnake pos5-7 pos5-6)
   goals met: 13 of 19
40. (move-and-eat pos5-7 pos6-7 dir-down)
   deleted: (headsnake pos5-7) (ispoint pos6-7)
   added: (blocked pos6-7) (headsnake pos6-7) (nextsnake pos6-7 pos5-7)
   goals met: 14 of 19
41. (move-and-eat pos6-7 pos7-7 dir-down)
   deleted: (headsnake pos6-7) (ispoint pos7-7)
   added: (blocked pos7-7) (headsnake pos7-7) (nextsnake pos7-7 pos6-7)
   goals met: 15 of 19
42. (move-and-eat pos7-7 pos7-6 dir-left)
   deleted: (headsnake pos7-7) (ispoint pos7-6)
   added: (blocked pos7-6) (headsnake pos7-6) (nextsnake pos7-6 pos7-7)
   goals met: 16 of 19
43. (move-and-eat pos7-6 pos7-5 dir-left)
   deleted: (headsnake pos7-6) (ispoint pos7-5)
   added: (blocked pos7-5) (headsnake pos7-5) (nextsnake pos7-5 pos7-6)
   goals met: 17 of 19
44. (move-fat-snake pos7-5 pos6-5 pos2-3 pos2-4 dir-up)
   deleted: (headsnake pos7-5) (blocked pos2-3) (tailsnake pos2-3) (nextsnake pos2-4 pos2-3)
   added: (blocked pos6-5) (headsnake pos6-5) (nextsnake pos6-5 pos7-5) (tailsnake pos2-4)
   goals met: 17 of 19
45. (move-fat-snake pos6-5 pos6-4 pos2-4 pos1-4 dir-left)
   deleted: (headsnake pos6-5) (blocked pos2-4) (tailsnake pos2-4) (nextsnake pos1-4 pos2-4)
   added: (blocked pos6-4) (headsnake pos6-4) (nextsnake pos6-4 pos6-5) (tailsnake pos1-4)
   goals met: 17 of 19
46. (move-fat-snake pos6-4 pos6-3 pos1-4 pos1-5 dir-left)
   deleted: (headsnake pos6-4) (blocked pos1-4) (tailsnake pos1-4) (nextsnake pos1-5 pos1-4)
   added: (blocked pos6-3) (headsnake pos6-3) (nextsnake pos6-3 pos6-4) (tailsnake pos1-5)
   goals met: 17 of 19
47. (move-fat-snake pos6-3 pos5-3 pos1-5 pos0-5 dir-up)
   deleted: (headsnake pos6-3) (blocked pos1-5) (tailsnake pos1-5) (nextsnake pos0-5 pos1-5)
   added: (blocked pos5-3) (headsnake pos5-3) (nextsnake pos5-3 pos6-3) (tailsnake pos0-5)
   goals met: 17 of 19
48. (move-fat-snake pos5-3 pos5-2 pos0-5 pos0-6 dir-left)
   deleted: (headsnake pos5-3) (blocked pos0-5) (tailsnake pos0-5) (nextsnake pos0-6 pos0-5)
   added: (blocked pos5-2) (headsnake pos5-2) (nextsnake pos5-2 pos5-3) (tailsnake pos0-6)
   goals met: 17 of 19
49. (move-and-eat pos5-2 pos5-1 dir-left)
   deleted: (headsnake pos5-2) (ispoint pos5-1)
   added: (blocked pos5-1) (headsnake pos5-1) (nextsnake pos5-1 pos5-2)
   goals met: 18 of 19
50. (move-fat-snake pos5-1 pos6-1 pos0-6 pos0-7 dir-down)
   deleted: (headsnake pos5-1) (blocked pos0-6) (tailsnake pos0-6) (nextsnake pos0-7 pos0-6)
   added: (blocked pos6-1) (headsnake pos6-1) (nextsnake pos6-1 pos5-1) (tailsnake pos0-7)
   goals met: 18 of 19
51. (move-and-eat pos6-1 pos6-0 dir-left)
   deleted: (headsnake pos6-1) (ispoint pos6-0)
   added: (blocked pos6-0) (headsnake pos6-0) (nextsnake pos6-0 pos6-1)
   goals met: 19 of 19
